Repository: 2103Java/PokeCare
Catalog: frontend/src/locale/messages.*.xlf
Languages: km

source: Add Pokemon
km: បន្ថែម Pokemon

source: Upload Photo
km: បញ្ចូលរូបថត

source: Settings
km: ការកំណត់

source: My Friends
km: មិត្ត​របស់ខ្ញុំ

source: View Pending Requests
km: មើលសំណើដែលមិនទាន់សម្រេច

source: Logout
km: ចាកចេញ

source: Happiness <mat-progress-bar class="example-margin" value="{{poke.happiness}}"></mat-progress-bar>
km: សប្បាយរីករាយ <mat-progress-bar class="example-margin" value="{{poke.happiness}}"></mat-progress-bar>

source: Hunger <mat-progress-bar class="example-margin" value="{{poke.hunger}}" i18n></mat-progress-bar>
km: ស្រេកឃ្លាន <mat-progress-bar class="example-margin" value="{{poke.hunger}}" i18n></mat-progress-bar>

source: Fatigue <mat-progress-bar class="example-margin" value="{{poke.fatigue}}"></mat-progress-bar>
km: ហត់កម្លាំង <mat-progress-bar class="example-margin" value="{{poke.fatigue}}"></mat-progress-bar>

source: Train
km: ហ្វឹកហាត់

source: Feed
km: ចិញ្ចឹម

source: Play
km: លេង

source: Return Pokemon
km: អោយPokemonវិញ

source: Return
km: ត្រឡប់មកវិញ

source: Add Friend
km: បន្ថែម​មិត្ត

source: Hide Friend Requests
km: លាក់សំណើមិត្តភក្តិ

source: Hide Friends Requests
km: លាក់សំណើមិត្តភក្តិ

source: Accept
km: ទទួលយក

source: Reject
km: បដិសេធ

source: Feed this Pokemon for ₽ 100?
km: អោយចំណីទៅPokemonនេះក្នុងតម្លៃ ₽ 100?

source: No
km: អត់ទេ

source: Yes
km: បាទ/ចាស

source: Fatigue: {{pokemon.fatigue}}% Hunger: {{pokemon.hunger}}%
km: ហត់កម្លាំង: {{pokemon.fatigue}}% ស្រេកឃ្លាន: {{pokemon.hunger}}%

source: Battle
km: ប្រយុទ្ធ

source: Cost: fatigue +100%, hunger +100%, xp +150
km: ចំណាយ: ហត់កម្លាំង +100%, ស្រេកឃ្លាន +100%, xp +150

source: Practice Moves
km: ហាត់ក្បាច់ប្រយុទ្

source: Obedience
km: គោរពប្រតិបត្តិ

source: Cost: fatigue +10%, hunger +10%, xp +30
km: ចំណាយ: ហត់កម្លាំង +10%, ស្រេកឃ្លាន +10%, xp +30

source: After Training: Fatigue = {{afterFatigue}}%, Hunger = {{afterHunger}}%
km: ក្រោយពីហ្វឹកហាត់ហើយ: ហត់កម្លាំង = {{afterFatigue}}%, ស្រេកឃ្លាន = {{afterHunger}}%

source: <b>Cancel</b>
km: <b>បោះបង់ចោល</b>

source: <b>Apply</b>
km: <b>អនុវត្ដន៍</b>

source: Are you sure you want to return {{pokemon.data.name}} to its trainer?
km: តើអ្នកពិតជាចង់ប្រគល់ {{pokemon.data.name}} ទៅម្ចាស់ដើមវាវិញមែនទេ?

source: Log in
km: ចូល

source: Username or Email
km: ឈ្មោះ​អ្នកប្រើប្រាស់​ ឬ អ៊ីមែល

# fieldRequired
source: This field is required
km: ចន្លោះនេះត្រូវតែបំពេញ

source: Password
km: លេខសម្ងាត់

source: Don't have an account? <span> <a style="color: blue;" [routerLink]="['/register']"> Register </a> </span>
km: ឣត់មានគណនីមែនទេ? <span> <a style="color: blue;" [routerLink]="['/register']"> ចុះឈ្មោះ </a> </span>

source: Register
km: ចុះឈ្មោះ

source: Username
km: ឈ្មោះ​អ្នកប្រើប្រាស់​

source: Email
km: អ៊ីមែល

source: Enter a valid email
km: បញ្ចូលអ៊ីមែលអោយត្រឹមត្រូវ

source: Confirm Password
km: បញ្ជាក់លេខសម្ងាត់

source: Passwords do not match
km: លេខសម្ងាត់មិនត្រូវគ្នា

source: Already registered? <span> <a style="color: blue;" [routerLink]="['/']"> Log in </a> </span>
km: បានចុះឈ្មោះរួចហើយ? <span> <a style="color: blue;" [routerLink]="['/']"> ចូល </a> </span>

source: Upload Image
km: បញ្ចូលរូបភាព

source: Apply
km: អនុវត្ដន៍
